senserf/picos/PicOS/MSP430/main.c
#include "kernel.h"

/* ==================================================================== */
/* Copyright (C) Olsonet Communications, 2002 - 2008                    */
/* All rights reserved.                                                 */
/* ==================================================================== */

#include "pins.h"
#include "irq_timer_headers.h"

#ifndef	MCLOCK_FROM_CRYSTAL
#define	MCLOCK_FROM_CRYSTAL	0
#endif

extern 			pcb_t		*zz_curr;
extern 			address	zz_utims [MAX_UTIMERS];
extern	void		_reset_vector__;

word			zz_restart_sp;

#define	STACK_SENTINEL	0xB779

void	zz_malloc_init (void);

/* ========================== */
/* Device driver initializers */
/* ========================== */

#if	UART_DRIVER || UART_TCV || UARTP_TCV

static void preinit_uart (void);

#if	UART_DRIVER

#define	N_UARTS	UART_DRIVER

#if	UART_INPUT_FLOW_CONTROL || UART_OUTPUT_FLOW_CONTROL
#if	UART_DRIVER > 1
#error	"flow control is only available when UART_DRIVER == 1"
#endif

#endif

static void	devinit_uart (int);

#else	/* UART_DRIVER */

#if UART_TCV
#define	N_UARTS	UART_TCV
#else
#define	N_UARTS	UARTP_TCV
#endif

#endif	/* UART_DRIVER */

#endif  /* UART_DRIVER || UART_TCV || UARTP_TCV */

extern void	__bss_end;

#if MAX_DEVICES

const static devinit_t devinit [MAX_DEVICES] = {
/* === */
#if	UART_DRIVER
		{ devinit_uart,	 0 },
#else
		{ NULL, 0 },
#endif
/* === */
#if	MAX_DEVICES > 1
#if	UART_DRIVER > 1
		{ devinit_uart,	 1 },
#else
		{ NULL, 0 }
#endif
#endif	/* MAX_DEVICES */
	 };

#endif	/* MAX_DEVICES */

static void ssm_init (void), mem_init (void), ios_init (void);


void clockdown (void) {

#if HIGH_CRYSTAL_RATE
	// Sorry, the watchdog must be stopped in the slow-clock mode if ACLK
	// is driven by a high-speed crystal
	WATCHDOG_HOLD;
#endif
	TBCCR0 = TIMER_B_INIT_LOW;	// 1, 2, or 16 ticks per second
}

void clockup (void) {

	TBCCR0 = TIMER_B_INIT_HIGH;	// 1024 ticks per second

#if HIGH_CRYSTAL_RATE
	// Resume the watchdog (it is never stopped if ACLK is driven by a
	// low-speed crystal
	WATCHDOG_RESUME;
#endif

}

void powerdown (void) {

	zz_systat.pdmode = 1;
	clockdown ();
#if CRYSTAL2_RATE
	// Disable XTL2
	_BIS (BCSCTL1, XT2OFF);
#endif
}

void powerup (void) {

#if CRYSTAL2_RATE
	// Enable XTL2
	_BIC (BCSCTL1, XT2OFF);
#endif
	clockup ();
	zz_systat.pdmode = 0;
}

void reset (void) {

	cli_tim;
#ifdef	EEPROM_PRESENT
	ee_sync (WNONE);
#endif
	hard_reset;
}

void halt (void) {

	cli_tim;
	diag ("PicOS halted");
	mdelay (500);
	while (1)
		_BIS_SR (LPM4_bits);
}

#if	ADC_PRESENT
// There is no general ADC interface at the moment. Well, not of the same
// kind as there used to be for eCOG. There is an ADC sampler (see
// ../adc_sampler.[ch]) as well as various board-specific hooks to the ADC.
// Also, the ADC is used internally for Radio RSSI.
#endif

int main (void) {

#if	STACK_GUARD
	{ register word i;
	for (i = 0; i < (STACK_SIZE / sizeof (word)); i++)
		// This leaves out one word at the very bottom, but that's
		// fine
		*((((address)STACK_END) - 1) + i) = STACK_SENTINEL;
	}
#endif
	/* Initialization */
	ssm_init ();
	mdelay (1);
	mem_init ();
	mdelay (1);
	ios_init ();

#if	TCV_PRESENT
	tcv_init ();
#endif
	/* The event loop */
	zz_curr = (pcb_t*) fork (root, NULL);
	/* Delay root startup until the drivers have been initialized */
	delay (16, 0);
	// Start the clock
	sti_tim;
	_EINT ();

	// We run at the longest possible interval, which means 1 sec for
	// the standard 32768Hz crystal, but may mean as little as 1/250 sec
	// for the 8MHz crystal.
	WATCHDOG_START;

	// Run the scheduler

#include "scheduler.h"

}

#if DIAG_MESSAGES > 1
void zzz_syserror (int ec, const char *m) {

	WATCHDOG_HOLD;

#if	DUMP_MEMORY
	dmp_mem ();
#endif
	diag ("SYSTEM ERROR: %x, %s", ec, m);
#else
void zzz_syserror (int ec) {

	WATCHDOG_HOLD;

	dbg_0 (ec); // SYSTEM ERROR
	diag ("SYSTEM ERROR: %x", ec);
#endif
	cli;

#if RESET_ON_SYSERR

#if LEDS_DRIVER
	for (zz_lostk = 0; zz_lostk < 32; zz_lostk++) {
		leds (0, 1); leds (1, 1); leds (2, 1); leds (3, 1);
		mdelay (100);
		leds (0, 0); leds (1, 0); leds (2, 0); leds (3, 0);
		mdelay (100);
	}
#endif
	while (1) 
		reset ();

#else	/* RESET_ON_SYSERR */

#ifdef	EEPROM_PRESENT
	ee_sync (WNONE);
#endif
	while (1) {
#if LEDS_DRIVER
		leds (0, 1); leds (1, 1); leds (2, 1); leds (3, 1);
		mdelay (100);
		leds (0, 0); leds (1, 0); leds (2, 0); leds (3, 0);
		mdelay (100);
#else
		_BIS_SR (LPM4_bits);
#endif
	}
#endif	/* RESET_ON_SYSERR */
}

static void ssm_init () {

	// Disable watchdog timer
	WATCHDOG_STOP;

#ifndef	PIN_DEFAULT_P1SEL
#define	PIN_DEFAULT_P1SEL	0x00
#endif
#ifndef	PIN_DEFAULT_P1DIR
#define	PIN_DEFAULT_P1DIR	0xFF	// For power savings, the default is OUT
#endif
#ifndef	PIN_DEFAULT_P1OUT
#define	PIN_DEFAULT_P1OUT	0x00
#endif

#ifndef	PIN_DEFAULT_P2SEL
#define	PIN_DEFAULT_P2SEL	0x00
#endif
#ifndef	PIN_DEFAULT_P2DIR
#define	PIN_DEFAULT_P2DIR	0xFF
#endif
#ifndef	PIN_DEFAULT_P2OUT
#define	PIN_DEFAULT_P2OUT	0x00
#endif

#ifndef	PIN_DEFAULT_P3SEL
#define	PIN_DEFAULT_P3SEL	0x00
#endif
#ifndef	PIN_DEFAULT_P3DIR
#define	PIN_DEFAULT_P3DIR	0xFF
#endif
#ifndef	PIN_DEFAULT_P3OUT
#define	PIN_DEFAULT_P3OUT	0x00
#endif

#ifndef	PIN_DEFAULT_P4SEL
#define	PIN_DEFAULT_P4SEL	0x00
#endif
#ifndef	PIN_DEFAULT_P4DIR
#define	PIN_DEFAULT_P4DIR	0xFF
#endif
#ifndef	PIN_DEFAULT_P4OUT
#define	PIN_DEFAULT_P4OUT	0x00
#endif

#ifndef	PIN_DEFAULT_P5SEL
#define	PIN_DEFAULT_P5SEL	0x00
#endif
#ifndef	PIN_DEFAULT_P5DIR
#define	PIN_DEFAULT_P5DIR	0xFF
#endif
#ifndef	PIN_DEFAULT_P5OUT
#define	PIN_DEFAULT_P5OUT	0x00
#endif

#ifndef	PIN_DEFAULT_P6SEL
#define	PIN_DEFAULT_P6SEL	0x00
#endif
#ifndef	PIN_DEFAULT_P6DIR
#define	PIN_DEFAULT_P6DIR	0xFF
#endif
#ifndef	PIN_DEFAULT_P6OUT
#define	PIN_DEFAULT_P6OUT	0x00
#endif

#ifdef	__MSP430_HAS_PORT7__

#ifndef	PIN_DEFAULT_P7SEL
#define	PIN_DEFAULT_P7SEL	0x00
#endif
#ifndef	PIN_DEFAULT_P7DIR
#define	PIN_DEFAULT_P7DIR	0xFF
#endif
#ifndef	PIN_DEFAULT_P7OUT
#define	PIN_DEFAULT_P7OUT	0x00
#endif

#endif

#ifdef	__MSP430_HAS_PORT8__

#ifndef	PIN_DEFAULT_P8SEL
#define	PIN_DEFAULT_P8SEL	0x00
#endif
#ifndef	PIN_DEFAULT_P8DIR
#define	PIN_DEFAULT_P8DIR	0xFF
#endif
#ifndef	PIN_DEFAULT_P8OUT
#define	PIN_DEFAULT_P8OUT	0x00
#endif

#endif

