senserf/picos/PicOS/MSP430/main.c
#ifdef	__MSP430_HAS_PORT9__

#ifndef	PIN_DEFAULT_P9SEL
#define	PIN_DEFAULT_P9SEL	0x00
#endif
#ifndef	PIN_DEFAULT_P9DIR
#define	PIN_DEFAULT_P9DIR	0xFF
#endif
#ifndef	PIN_DEFAULT_P9OUT
#define	PIN_DEFAULT_P9OUT	0x00
#endif

#endif

#ifdef	__MSP430_HAS_PORT10__

#ifndef	PIN_DEFAULT_P10SEL
#define	PIN_DEFAULT_P10SEL	0x00
#endif
#ifndef	PIN_DEFAULT_P10DIR
#define	PIN_DEFAULT_P10DIR	0xFF
#endif
#ifndef	PIN_DEFAULT_P10OUT
#define	PIN_DEFAULT_P10OUT	0x00
#endif

#endif

	// Pre-initialize pins
	P1IE = P2IE = 0x00;
	P1IES = P2IES = 0x00;
	P1IFG = P2IFG = 0x00;

	P1SEL = PIN_DEFAULT_P1SEL;
	P1OUT = PIN_DEFAULT_P1OUT;
	P1DIR = PIN_DEFAULT_P1DIR;

	P2SEL = PIN_DEFAULT_P2SEL;
	P2OUT = PIN_DEFAULT_P2OUT;
	P2DIR = PIN_DEFAULT_P2DIR;

	P3SEL = PIN_DEFAULT_P3SEL;
	P3OUT = PIN_DEFAULT_P3OUT;
	P3DIR = PIN_DEFAULT_P3DIR;

	P4SEL = PIN_DEFAULT_P4SEL;
	P4OUT = PIN_DEFAULT_P4OUT;
	P4DIR = PIN_DEFAULT_P4DIR;

	P5SEL = PIN_DEFAULT_P5SEL;
	P5OUT = PIN_DEFAULT_P5OUT;
	P5DIR = PIN_DEFAULT_P5DIR;

	P6SEL = PIN_DEFAULT_P6SEL;
	P6OUT = PIN_DEFAULT_P6OUT;
	P6DIR = PIN_DEFAULT_P6DIR;


#ifdef	__MSP430_HAS_PORT7__
	P7SEL = PIN_DEFAULT_P7SEL;
	P7OUT = PIN_DEFAULT_P7OUT;
	P7DIR = PIN_DEFAULT_P7DIR;
#endif
#ifdef	__MSP430_HAS_PORT8__
	P8SEL = PIN_DEFAULT_P8SEL;
	P8OUT = PIN_DEFAULT_P8OUT;
	P8DIR = PIN_DEFAULT_P8DIR;
#endif
#ifdef	__MSP430_HAS_PORT9__
	P9SEL = PIN_DEFAULT_P9SEL;
	P9OUT = PIN_DEFAULT_P9OUT;
	P9DIR = PIN_DEFAULT_P9DIR;
#endif
#ifdef	__MSP430_HAS_PORT10__
	P10SEL = PIN_DEFAULT_P10SEL;
	P10OUT = PIN_DEFAULT_P10OUT;
	P10DIR = PIN_DEFAULT_P10DIR;
#endif

// ======================
// Monitor pins overrides
// ======================
#ifdef	MONITOR_PIN_CPU
	_PDS (MONITOR_PIN_CPU, 1);
#endif
#ifdef	MONITOR_PIN_CLOCK
	_PDS (MONITOR_PIN_CLOCK, 1);
#endif
#ifdef	MONITOR_PIN_SCHED
	_PDS (MONITOR_PIN_SCHED, 1);
#endif
// ======================

// ===========================================================================
// Clock setup ===============================================================
// ===========================================================================

#ifdef	__MSP430_1xx__

// ===========================================================================

#if MCLOCK_FROM_CRYSTAL == 0

	// DCO: select maximum frequency
	DCOCTL = DCO2 + DCO1 + DCO0;
	BCSCTL1 = RSEL2 + RSEL1 + RSEL0 + XT2OFF

#if	CRYSTAL_RATE != 32768
	// We are using a high-speed crystal for XT1
		+ XTS
#endif
	;
	// Measured MCLK is ca. 4.5 MHz

// This is in kHz
#define	CPU_CLOCK_RATE	4500

#if 	CRYSTAL2_RATE
	// Assign SMCLK to XTL2
	BCSCTL2 = SELM_DCOCLK | SELS;
#endif

#endif	/* MCLOCK_FROM_CRYSTAL == 0 */

// ===========================================================================

#if MCLOCK_FROM_CRYSTAL	== 1

#if CRYSTAL_RATE < 4000000
#error "CRYSTAL_RATE must be >= 4000000 for MCLOCK_FROM_CRYSTAL == 1"
#endif

// Clock from crystal 1

	BCSCTL1 |= XTS;
	do {
		_BIC (IFG1, OFIFG);
		udelay (100);
	} while ((IFG1 & OFIFG) != 0);

  	BCSCTL2 = SELM1 + SELM0

#if CRYSTAL2_RATE > CRYSTAL_RATE
	// Assign SMCLK to XTL2
		+ SELS
#endif
	; 

#define	CPU_CLOCK_RATE	(CRYSTAL_RATE / 1000)

#endif	/* MCLOCK_FROM_CRYSTAL == 1 */

// ===========================================================================

#if MCLOCK_FROM_CRYSTAL == 2

#if CRYSTAL2_RATE == 0
#error "Need XT2 for MCLOCK_FROM_CRYSTAL == 2"
#endif
	// Clock from crystal 2: make sure the second oscillator is running
	_BIC_SR (LPM4_bits);

	// Make sure XT2 is enabled
	BCSCTL1 = 0;

	do {
		_BIC (IFG1, OFIFG);
		udelay (100);
	} while ((IFG1 & OFIFG) != 0);

	// SELS is not needed, I think
	BCSCTL2 = SELM1 | SELS; 

#define	CPU_CLOCK_RATE	(CRYSTAL2_RATE / 1000)

#endif	/* MCLOCK_FROM_CRYSTAL == 2 */

#endif	/* 1xx */


// ===========================================================================
// ===========================================================================

#ifdef	__MSP430_4xx__

// The FLL variant

#ifndef	XCAPACITY
#define	XCAPACITY	XCAP10PF
#endif

#if CRYSTAL_RATE != 32768
#define	__XTS	XTS_FLL
#else
#define	__XTS	0
#endif

#if MCLOCK_FROM_CRYSTAL == 0

// MCLOCK from DCO driven by crystal 1

#define	__scfqctl_set (8000000/CRYSTAL_RATE)

#if __scfqctl_set > 128
	FLL_CTL0 = DCOPLUS + XCAPACITY + __XTS;
   	SCFQCTL = (__scfqctl_set/2) - 1;
#define	CPU_CLOCK_RATE	(((__scfqctl_set/2) * 2 * CRYSTAL_RATE) / 1000)
#else
	FLL_CTL0 = XCAPACITY + __XTS;
   	SCFQCTL = __scfqctl_set - 1;
#define	CPU_CLOCK_RATE	(((__scfqctl_set) * 2 * CRYSTAL_RATE) / 1000)
#endif

// MCLK from DCO
#define	__SELM	SELM0

#endif	/* MCLOCK_FROM_CRYSTAL == 0 */

// ===========================================================================

#if MCLOCK_FROM_CRYSTAL == 1

// MCLOCK driven directly by crystal 1

#if CRYSTAL_RATE < 4000000
#error "CRYSTAL_RATE must be >= 4000000 for MCLOCK_FROM_CRYSTAL == 1"
#endif
	FLL_CTL0 = XCAP0PF + __XTS;

#define	CPU_CLOCK_RATE	(CRYSTAL_RATE / 1000)

// This is the default

// MCLK from crystal 1
#define	__SELM	SELM3

#endif /* MCLOCK_FROM_CRYSTAL == 1 */

// ===========================================================================

#if MCLOCK_FROM_CRYSTAL == 2

// MCLOCK driven directly by crystal 2

#if CRYSTAL2_RATE == 0
#error "Need XT2 for MCLOCK_FROM_CRYSTAL == 2"
#endif
	FLL_CTL0 = XCAP0PF + __XTS;

	// Disable DCO
	_BIS_SR(SCG1);

	_BIC (FLL_CTL1, XT2OFF);

	do {
		_BIC (IFG1, OFIFG);	// Clear fault flag
		udelay (100);
	} while ((IFG1 & OFIFG) != 0);

#define	CPU_CLOCK_RATE	(CRYSTAL2_RATE / 1000)

// MCLK from crystal 2
#define	__SELM	(SELM2 + SELS)

#endif /* MCLOCK_FROM_CRYSTAL == 2 */

// ===========================================================================

	FLL_CTL1 = __SELM

#if CRYSTAL2_RATE == 0
		+ XT2OFF
#endif
	;

// ===========================================================================
#if 0
	//
	// This is the best I could get through rather tedious experiments
	//
	SCFQCTL = 63;			// ACLK * 64 = 32768 * 64 = 2097152 Hz
	SCFI0 =	FLLD_2 | FN_2;		// ... * 2 = 4,194,304
	// SCFI0 =	FLLD_4 | FN_3;	// ... * 4 = 8,388,608 Hz, (2 -- 17.9)
	_BIS (FLL_CTL0, DCOPLUS);	// Mutiplier active
	// This yields 4MHz + for the CPU clock
#endif	/* 0 -- was 449 */
// ===========================================================================

