senserf/picos/PicOS/MSP430/main.c
#endif	/* 4xx */

	// System timer
	TBCTL = TBSSEL0 | TBCLR; 	// ACLK source
	_BIS (TBCTL, ID0 | ID1);	// divided by 8 = 4096 ticks/sec

	// Select power up and high clock rate
	powerup ();

#if HIGH_CRYSTAL_RATE
	// Was set by powerup, we have to stop it until we actually start
	// the clock
	WATCHDOG_HOLD;
#endif
	// Start it in up mode, interrupts still disabled
	_BIS (TBCTL, MC0);
}

#define	mkmk_eval

void udelay (register word n) {
/* =================================== */
/* n should be roughly in microseconds */
/* =================================== */
	__asm__ __volatile__ (
		"1:\n"
#if CPU_CLOCK_RATE > 2000
		" nop\n"
#endif
#if CPU_CLOCK_RATE > 4000
		" nop\n"
#endif
#if CPU_CLOCK_RATE > 6000
		" nop\n"
#endif
#if CPU_CLOCK_RATE > 7000
		" nop\n"
#endif
#if CPU_CLOCK_RATE > 8200
		" nop\n"
#endif
		" dec %[n]\n"
		" jne 1b\n"
			: [n] "+r"(n));
}

#undef mkmk_eval

void mdelay (word n) {
/* ============ */
/* milliseconds */
/* ============ */
	while (n--)
		udelay (995);
}
/* =============== */
/* Timer interrupt */
/* =============== */
interrupt (TIMERB0_VECTOR) timer_int () {

#ifdef	MONITOR_PIN_CLOCK
	_PVS (MONITOR_PIN_CLOCK, 1);
#endif

#if	STACK_GUARD
	if (*(((word*)STACK_END) - 1) != STACK_SENTINEL)
		syserror (ESTACK, "timer_int");
#endif

	// Clear hardware watchdog. Its sole purpose is to guard clock
	// interrupts, while clock interrupts implement a software watchdog.
	WATCHDOG_CLEAR;

	if (TBCCR0 == TIMER_B_INIT_HIGH) {
		// Power up: one tick == 1 JIFFIE
		/* This code assumes that MAX_UTIMERS is 4 */
#define	UTIMS_CASCADE(x) 	if (zz_utims [x]) {\
					 if (*(zz_utims [x]))\
						 (*(zz_utims [x]))--
		UTIMS_CASCADE(0);
		UTIMS_CASCADE(1);
		UTIMS_CASCADE(2);
		UTIMS_CASCADE(3);
		}}}}
#undef UTIMS_CASCADE
		zz_lostk++;

#if	ADC_PRESENT
		// Stub
#endif

		// Extras
#include "irq_timer.h"

		// Run the scheduler at least once every second - to
		// keep the second clock up to date
		if ((zz_lostk >= JIFFIES) ||
		    (zz_mintk && zz_mintk <= zz_lostk)) {

#if WATCHDOG_ENABLED
			if (zz_lostk >= 16 * JIFFIES ) {
				// Software watchdog reset: 16 seconds
#ifdef	WATCHDOG_SAVER
				WATCHDOG_CLEAR;
				WATCHDOG_SAVER ();
#endif
				reset ();
			}
			
#endif	/* WATCHDOG_ENABLED */

			RISE_N_SHINE;
		}

#ifdef	MONITOR_PIN_CLOCK
		_PVS (MONITOR_PIN_CLOCK, 0);
#endif
		RTNI;
	}

	// Here we are running in the SLOW mode: one tick ==
	// JIFFIES/TIMER_B_LOW_PER_SEC
#define	UTIMS_CASCADE(x) \
		if (zz_utims [x]) { \
		  if (*(zz_utims [x])) \
		    *(zz_utims [x]) = *(zz_utims [x]) > \
		      (JIFFIES/TIMER_B_LOW_PER_SEC) ? \
			*(zz_utims [x]) - (JIFFIES/TIMER_B_LOW_PER_SEC) : 0

	UTIMS_CASCADE(0);
	UTIMS_CASCADE(1);
	UTIMS_CASCADE(2);
	UTIMS_CASCADE(3);
	}}}}

	zz_lostk += JIFFIES/TIMER_B_LOW_PER_SEC;

#if TIMER_B_LOW_PER_SEC > 1
	if ((zz_lostk >= JIFFIES) || (zz_mintk && zz_mintk <= zz_lostk))
#endif
	{

#if WATCHDOG_ENABLED
		if (zz_lostk >= 16 * JIFFIES) {
			// Software watchdog reset (16 sec)
#ifdef	WATCHDOG_SAVER
			WATCHDOG_CLEAR;
			WATCHDOG_SAVER ();
#endif
			reset ();
		}
#endif	/* WATCHDOG_ENABLED */

		RISE_N_SHINE;
	}
	RTNI;
}

#if GLACIER
void freeze (word nsec) {
/*
 * Freezes the system in power-down mode for the specified number of seconds.
 */
	byte saveP1IE, saveP2IE;

#if UART_DRIVER || UART_TCV || UARTP_TCV
	byte saveIE1, saveIE2;
#endif
	byte saveLEDs;
	word saveLostK;

	// In case some of these take too long for the clock guard
	WATCHDOG_HOLD;

	cli;

	// Save I/O pin interrupt configuration
	saveP1IE = P1IE;
	saveP2IE = P2IE;
	// And disable them
	P1IE = P2IE = 0x00;

	// Save leds status and turn them off
	saveLEDs = leds_save ();
	leds_off ();

#if UART_DRIVER || UART_TCV || UARTP_TCV
	// Save UART interrupt configuration
	saveIE1 = IE1;
	saveIE2 = IE2;
	// And disable them
	IE1 = 0;
	IE2 = 0;
	while ((UTCTL_A & TXEPT) == 0);
#if N_UARTS > 1
	while ((UTCTL_B & TXEPT) == 0);
#endif
#endif

	// We should be OK now
	WATCHDOG_RESUME;

	powerdown ();
	// Save clock state
	saveLostK = zz_lostk;

	while (nsec) {
		zz_lostk = 0;
		_BIS_SR (LPM3_bits + GIE);
		cli;
		nsec--;
	}

	WATCHDOG_HOLD;

	P1IE = saveP1IE;
	P2IE = saveP2IE;

#if UART_DRIVER || UART_TCV || UARTP_TCV
	// Reset the UART to get it back to normal
	_BIS (UCTL_A, SWRST);
	_BIC (UCTL_A, SWRST);
#if N_UARTS > 1
	_BIS (UCTL_B, SWRST);
	_BIC (UCTL_B, SWRST);
#endif
	IE1 = saveIE1;
	IE2 = saveIE2;
#endif
	powerup ();

	// Trigger the interrupts if they are pending
	P1IFG = (P1IE & (P1IES ^ P1IN));
	P2IFG = (P2IE & (P2IES ^ P2IN));

	zz_lostk = saveLostK;
	leds_restore (saveLEDs);

	WATCHDOG_START;
	sti;
}

#endif	/* GLACIER */

static void mem_init () {

	zz_malloc_init ();
}

#if	STACK_GUARD
word zzz_stackfree (void) {

	word sc;
	for (sc = 0; sc < STACK_SIZE / sizeof (word); sc++)
		if (*(((word*)STACK_END) + sc) != STACK_SENTINEL)
			break;
	return sc;
}

#endif

static void ios_init () {

	int i;
	pcb_t *p;

#ifdef EEPROM_PRESENT
	zz_ee_init ();
#endif

#ifdef SENSOR_LIST
	zz_init_sensors ();
#endif

#ifdef ACTUATOR_LIST
	zz_init_actuators ();
#endif

#ifdef LCD_PRESENT
	zz_lcd_init ();
#endif

#ifdef LCDG_PRESENT
	zz_lcdg_init ();
#endif

#if INFO_FLASH
	zz_if_init ();
#endif

#if	UART_DRIVER || UART_TCV || UARTP_TCV
	// A UART is configured, initialize it beforehand without enabling
	// anything, which is up to the driver plugin. We just want to be able
	// to use diag.
	preinit_uart ();
#endif
	diag ("");

#ifdef	BANNER
	diag (BANNER);
#else
	diag ("PicOS v" SYSVERSION ", "
        	"Copyright (C) Olsonet Communications, 2002-2008");
	diag ("Leftover RAM: %d bytes", (word)STACK_END - (word)(&__bss_end));
#endif
	dbg_1 (0x1000 | SYSVER_B);
	dbg_1 ((word)STACK_END - (word)(&__bss_end)); // RAM in bytes

	for_all_tasks (p)
		/* Mark all task table entries as available */
		p->code = NULL;

	/* Processes can be created past this point */

#if MAX_DEVICES
	/* Initialize devices */
	for (i = UART; i < MAX_DEVICES; i++)
		if (devinit [i] . init != NULL)
			devinit [i] . init (devinit [i] . param);
#endif

	/* Make SMCLK/MCLK available on P5.5, P5.4 */
	//_BIS (P5OUT, 0x30);
	//_BIS (P5SEL, 0x30);
}

/* ------------------------------------------------------------------------ */
/* ============================ DEVICE DRIVERS ============================ */
/* ------------------------------------------------------------------------ */

#if	UART_DRIVER || UART_TCV || UARTP_TCV

uart_t	zz_uart [N_UARTS];

#if CRYSTAL2_RATE
// SMCLK
#define	utctl		SSEL1
#define	UART_CLOCK_RATE	CRYSTAL2_RATE
#else
// ACLK
#define	utctl		SSEL0
#define	UART_CLOCK_RATE	CRYSTAL_RATE
#endif

#if	UART_CLOCK_RATE == 32768
// This is the standard (or perhaps not any more?)
#define	ubr1		0

#if UART_RATE == 1200
#define	ubr0		0x1B
#define	umctl		0x03
#define	UART_RATE_INDEX	0
#endif

#if UART_RATE == 2400
#define	ubr0		0x0D
#define	umctl		0x6B
#define	UART_RATE_INDEX	1
#endif

#if UART_RATE == 4800
#define	ubr0		0x06
#define	umctl		0x6F
#define	UART_RATE_INDEX	2
#endif

#if UART_RATE == 9600
#define	ubr0		0x03
#define	umctl		0x4A
#define	UART_RATE_INDEX	3
#endif

#ifndef ubr0
#error "Illegal UART_RATE, can be 1200, 2400, 4800, 9600"
#endif

