senserf/picos/PicOS/MSP430/main.c
#else	/* UART_CLOCK_RATE > 32768 */

#if UART_RATE == 1200
#define	UART_RATE_INDEX	0
#endif
#if UART_RATE == 2400
#define	UART_RATE_INDEX	1
#endif
#if UART_RATE == 4800
#define	UART_RATE_INDEX	2
#endif
#if UART_RATE == 9600
#define	UART_RATE_INDEX	3
#endif
#if UART_RATE == 14400
#define	UART_RATE_INDEX	4
#endif
#if UART_RATE == 19200
#define	UART_RATE_INDEX	5
#endif
#if UART_RATE == 28800
#define	UART_RATE_INDEX	6
#endif
#if UART_RATE == 38400
#define	UART_RATE_INDEX	7
#endif
#if UART_RATE == 76800
#define	UART_RATE_INDEX	8
#endif
#if UART_RATE == 115200
#define	UART_RATE_INDEX	9
#endif
#if UART_RATE == 256000
#define	UART_RATE_INDEX	10
#endif

#ifndef	UART_RATE_INDEX
#error "Illegal UART_RATE"
#endif

// No need to use corrections for high-speed crystals. FIXME: may need 
// correction for 115200 and more.
#define	umctl		0
#define	ubr0		((UART_CLOCK_RATE/UART_RATE) % 256)
#define	ubr1		((UART_CLOCK_RATE/UART_RATE) / 256)

#endif	/* UART_CLOCK_RATE */

#if UART_BITS == 8

#define	uctl_char	CHAR
#define	uctl_pena	0
#define	uctl_pev	0

#else	/* UART_BITS == 7 */

#define	uctl_char	0
#define	uctl_pena	PENA

#if UART_PARITY == 0
#define	uctl_pev	PEV
#else
#define	uctl_pev	0
#endif

#endif	/* UART_BITS */

static void preinit_uart () {

	// UART_A
	UART_PREINIT_A;
#if UART_INPUT_FLOW_CONTROL || UART_OUTPUT_FLOW_CONTROL
	UART_PREINIT_A_FC;
#endif
	_BIS (UCTL_A, SWRST);
	_BIC (UTCTL_A, SSEL1 + SSEL0);
	_BIS (UTCTL_A, utctl);
	UBR0_A = ubr0;
	UBR1_A = ubr1;
	UMCTL_A = umctl;
	_BIS (IFG_A, UTXIFG_A);
	_BIS (ME_A, UTXE_A + URXE_A);
	_BIS (UCTL_A, uctl_char | uctl_pena | uctl_pev);
	_BIC (UCTL_A, SWRST);
#if UART_RATE_SETTABLE
	zz_uart [0] . flags = UART_RATE_INDEX;
#endif

/*
 * Note: the second UART doesn't want to work at 9600 with the standard slow
 * crystal. The xmitter is OK, but the receiver gets garbage. 4800 is fine. 
 * Also, things seem to work fine (up to 115200) with a high speed crystal.
 */
#if N_UARTS > 1
	// UART_B
	UART_PREINIT_B;
	_BIS (UCTL_B, SWRST);
	_BIC (UTCTL_B, SSEL1 + SSEL0);
	_BIS (UTCTL_B, utctl);
	UBR0_B = ubr0;
	UBR1_B = ubr1;
	UMCTL_B = umctl;
	_BIS (IFG_B, UTXIFG_B);
	_BIS (ME_B, UTXE_B + URXE_B);
	_BIS (UCTL_B, uctl_char | uctl_pena | uctl_pev);
	_BIC (UCTL_B, SWRST);
#if UART_RATE_SETTABLE
	zz_uart [1] . flags = UART_RATE_INDEX;
#endif

#endif	/* N_UARTS */
}

#if UART_RATE_SETTABLE

typedef struct	{

	word rate;
	byte A, B;
} uart_rate_t;

static const uart_rate_t urates [] = {

#if UART_CLOCK_RATE == 32768

    { 12, 0x1B, 0x03 },
    { 24, 0x0D, 0x6B },
    { 48, 0x06, 0x6F },
    { 96, 0x03, 0x4A }
#else
    {	12, (UART_CLOCK_RATE/  1200) % 256, (UART_CLOCK_RATE/  1200) / 256 },
    {	24, (UART_CLOCK_RATE/  2400) % 256, (UART_CLOCK_RATE/  2400) / 256 },
    {	48, (UART_CLOCK_RATE/  4800) % 256, (UART_CLOCK_RATE/  4800) / 256 },
    {	96, (UART_CLOCK_RATE/  9600) % 256, (UART_CLOCK_RATE/  9600) / 256 },
    {  144, (UART_CLOCK_RATE/ 14400) % 256, (UART_CLOCK_RATE/ 14400) / 256 },
    {  192, (UART_CLOCK_RATE/ 19200) % 256, (UART_CLOCK_RATE/ 19200) / 256 },
    {  288, (UART_CLOCK_RATE/ 28800) % 256, (UART_CLOCK_RATE/ 28800) / 256 },
    {  384, (UART_CLOCK_RATE/ 38400) % 256, (UART_CLOCK_RATE/ 38400) / 256 },
    {  768, (UART_CLOCK_RATE/ 76800) % 256, (UART_CLOCK_RATE/ 76800) / 256 },
    { 1152, (UART_CLOCK_RATE/115200) % 256, (UART_CLOCK_RATE/115200) / 256 },
    { 2560, (UART_CLOCK_RATE/256000) % 256, (UART_CLOCK_RATE/256000) / 256 }
#endif

};

#define	N_RATES		(sizeof(urates) / sizeof(uart_rate_t))

Boolean zz_uart_setrate (word rate, uart_t *ua) {

	byte j, saveIE;

	for (j = 0; j < N_RATES; j++) {
		if (rate == urates [j] . rate) {
			// Found
#if N_UARTS > 1
			if (ua != zz_uart) {
				// UART_B
				UBR0_B = urates [j].A;
#if UART_CLOCK_RATE == 32768
				UBR1_B = 0;
				UMCTL_B = urates [j].B;
#else
				UBR1_B = urates [j].B;
				UMCTL_B = 0;
#endif
			} else {
#endif	/* N_UARTS */
				UBR0_A = urates [j].A;
#if UART_CLOCK_RATE == 32768
				UBR1_A = 0;
				UMCTL_A = urates [j].B;
#else
				UBR1_A = urates [j].B;
				UMCTL_A = 0;
#endif

#if N_UARTS > 1
			}
#endif
			ua->flags = (ua->flags & ~UART_RATE_MASK) | j;
			return YES;
		}
	}
	return NO;
}

word zz_uart_getrate (uart_t *ua) {

	return urates [ua->flags & UART_RATE_MASK] . rate;
}

#endif 	/* UART_RATE_SETTABLE */

/* ------------------------------------------------------------------------ */
/* ------------------------------------------------------------------------ */

#endif	/* UART_DRIVER || UART_TCV || UARTP_TCV */

#if	UART_DRIVER
/* ======== */
/* The UART */
/* ======== */

#define uart_xpending(u)	__ualt(u, IFG_B&UTXIFG_B, IFG_A&UTXIFG_A)

#define	uart_write8(u,w)	__usel (u, TXBUF_B = (w), TXBUF_A = (w))

#define uart_enable_write_int(u) __usel (u, uart_b_enable_write_int, \
						uart_a_enable_write_int)

#define uart_disable_int(u)	__usel (u, uart_b_disable_int, \
						uart_a_disable_int)

#define uart_disable_read_int(u) __usel (u, uart_b_disable_read_int, \
						uart_a_disable_read_int)

#define uart_disable_write_int(u) __usel (u, uart_b_disable_write_int, \
						uart_a_disable_write_int)

#define uart_rpending(u)       __ualt (u, IFG_B&URXIFG_B, IFG_A&URXIFG_A)

#define	uart_read(u)		__ualt (u, RXBUF_B, RXBUF_A)

#define uart_enable_read_int(u)	__usel (u, uart_b_enable_read_int, \
						uart_a_enable_read_int)

static void uart_lock (uart_t*), uart_unlock (uart_t*);

/* ======================= */
/* Common request function */
/* ======================= */
static INLINE int ioreq_uart (uart_t *u, int operation, char *buf, int len) {

	switch (operation) {

		case READ:

			if ((u->flags & UART_FLAGS_LOCK)) {
				// Raw operation, interrupts disabled
				if (len && uart_rpending (u)) {
					*buf = uart_read (u);
					return 1;
				}
				return 0;
			} else {

#if UART_INPUT_BUFFER_LENGTH > 1
				uart_disable_read_int (u);
				if (u->ib_count == 0) {
					// The buffer is empty
					_BIS (u->flags, UART_FLAGS_IN);
					return -2;
				}
				_BIC (u->flags, UART_FLAGS_IN);
				uart_enable_read_int (u);
				operation = len;
				while (len) {
					uart_disable_read_int (u);
					if (u->ib_count == 0) {
						uart_enable_read_int (u);
						break;
					}
					u->ib_count--;
					uart_enable_read_int (u);
#if UART_INPUT_FLOW_CONTROL
					if (u->ib_count <=
						UART_INPUT_BUFFER_LENGTH/2)
							UART_SET_RTR;
#endif
					*buf++ = u->in [u->ib_out];
					if (++(u->ib_out) ==
						UART_INPUT_BUFFER_LENGTH)
							u->ib_out = 0;
					len--;
				}
				return operation - len;
#else
				if ((u->flags & UART_FLAGS_IN)) {
					// Receive interrupt is disabled
R_redo:
					*buf = u->in;
					_BIC (u->flags, UART_FLAGS_IN);
					uart_enable_read_int (u);
#if UART_INPUT_FLOW_CONTROL
					UART_SET_RTR;
#endif
					return 1;
				}
				uart_disable_read_int (u);
				if ((u->flags & UART_FLAGS_IN))
					// Account for the race
					goto R_redo;
				// The buffer is empty
				return -2;
#endif
			}
				
		case WRITE:

			if ((u->flags & UART_FLAGS_LOCK)) {
				if (len && uart_xpending (u)) {
					uart_write8 (u, *buf);
					return 1;
				}
				return 0;
			} else {
#if UART_OUTPUT_FLOW_CONTROL
				if (!UART_TST_RTR) {
					return - 16 - 2
				}
#endif
				if ((u->flags & UART_FLAGS_OUT) == 0) {
X_redo:
					u->out = *buf;
					_BIS (u->flags, UART_FLAGS_OUT);
					uart_enable_write_int (u);
					return 1;
				}
				uart_disable_write_int (u);
				if ((u->flags & UART_FLAGS_OUT) == 0)
					goto X_redo;
				return -2;
			}
					
		case NONE:

